app/Controllers/dashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `category_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `category_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {
        // Hitung jumlah produk berdasarkan kategori
        $kategoriIos = $this->productModel
            ->where('category_id', $this->getCategoryIdByName('iOS'))
            ->countAllResults();

        $kategoriAndroid = $this->productModel
            ->where('category_id', $this->getCategoryIdByName('Android'))
            ->countAllResults();

        // Data yang akan dikirim ke view
        $data = [
            'kategoriIos' => $kategoriIos,
            'kategoriAndroid' => $kategoriAndroid,
            'totalProduk' => $this->productModel->countAllResults(),

SELECT *
FROM `categories`
WHERE `name_categories` = 'iOS'
 LIMIT 1
---
    private function getCategoryIdByName($categoryName)
    {
        $category = $this->categoryModel->where('name_categories', $categoryName)->first();