app/Controllers/productController.php

    public function index()
{
    $data['products'] = $this->productModel
        ->select('products.*, categories.name_categories')
        ->join('categories', 'categories.id = products.category_id', 'left')
        ->findAll();

    // Tambahkan data kategori
    $data['categories'] = $this->categoryModel->findAll();
---
SELECT `products`.*, `categories`.`name_categories`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
SELECT *
FROM `categories`

    public function store()
{
    $fileThumbnail = $this->request->getFile('thumbnail');

    // Periksa apakah file diupload
    if ($fileThumbnail && $fileThumbnail->isValid() && !$fileThumbnail->hasMoved()) {
        // Simpan file ke folder 'uploads'
        $newName = $fileThumbnail->getRandomName();
        $fileThumbnail->move(ROOTPATH . 'public/uploads', $newName);

        // Simpan nama file ke database
        $thumbnail = $newName;
    } else {
        $thumbnail = null; // Atau beri default value
    }

    $this->productModel->save([
        'thumbnail'   => $thumbnail,
        'product'     => $this->request->getPost('product'),
        'price'       => $this->request->getPost('price'),
        'category_id' => $this->request->getPost('category_id'),
    ]);
---
INSERT INTO `products` (`thumbnail`, `product`, `price`, `category_id`) VALUES ('1736733189_a17f9e0c84e176038c1d.jpg', 'Iphone 11 Pro Max', '6799999', '2')

    public function update($id)
{
    $fileThumbnail = $this->request->getFile('thumbnail');

    // Ambil data produk lama
    $product = $this->productModel->find($id);

    if ($fileThumbnail && $fileThumbnail->isValid() && !$fileThumbnail->hasMoved()) {
        // Simpan file baru
        $newName = $fileThumbnail->getRandomName();
        $fileThumbnail->move('uploads', $newName);

        // Hapus file lama jika ada
        if ($product['thumbnail'] && file_exists($product['thumbnail'])) {
            unlink($product['thumbnail']);
        }

        $thumbnail = 'uploads/' . $newName;
    } else {
        // Jika tidak ada file baru, gunakan file lama
        $thumbnail = $product['thumbnail'];
    }

    // Update data produk
    $this->productModel->update($id, [
        'thumbnail'   => $thumbnail,
        'product'     => $this->request->getPost('product'),
        'price'       => $this->request->getPost('price'),
        'category_id' => $this->request->getPost('category_id'),
    ]);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '29'
UPDATE `products` SET `thumbnail` = '1736733189_a17f9e0c84e176038c1d.jpg', `product` = 'Iphone 11 Pro Max', `price` = '6999999.00', `category_id` = '2'
WHERE `products`.`id` IN ('29')

    public function delete($id)
{
    // Ambil data produk berdasarkan ID
    $product = $this->productModel->find($id);

    // Hapus file thumbnail jika ada
    if ($product['thumbnail'] && file_exists($product['thumbnail'])) {
        unlink($product['thumbnail']);
    }

    // Hapus data produk dari database
    $this->productModel->delete($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '29'
DELETE FROM `products`
WHERE `id` IN ('29')